Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.AnalysisPartLoadingProperties Property
 The analysis part loading properties.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPartLoadingProperties AnalysisPartLoadingProperties { get; set; }
Public Property AnalysisPartLoadingProperties As AnalysisPartLoadingProperties
	Get
	Set
Property Value
Type: AnalysisPartLoadingProperties
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace